window.teachers = {

//請直接在以下位置貼上

//梨家的狸貓老師
  Iblis: {
  title: "",
  bigname: "伊比莉絲",
  littlename: "",
  img: "img/Iblis.png",
  bg: "img/11.webp",
  useDarkBg: false,

  info: {
    "陣營": "黑色陣營",
    "種族": "鈴林的狸貓",
    "年齡": "22",
    "性別": "女",
    "身高": "181",
    "體重": "58",
    "個性": `・憐愛所有人：不過並不了解人類，時常幹出傻事
・休閒養老：互動有高機率觸發下午茶事件
真的需要戰鬥時還是很有用的`,
    "喜歡": `大家都喜歡,不管什麼都喜歡(砍除自己所認知的惡人也是)……不過真要說，我們還是最喜歡“她”了、阿！還有酒！`,
    "討厭": `和身為雙胞胎的對方分開，或是“她”的不告而別。`,
    "角色備註/裏設定": `兩姊妹內外幾乎一樣(僅有遮住的眼睛顏色不同)，兩人十分堅定是一體的。
只要手邊有葉子，便能幻形心中所想的願望。
放在頭上*啪！*可愛小狸貓不在話下！`,
    "背景故事/設定": `家鄉為鈴林的狸貓村，不過在時代更迭與人類紛爭下滅村了，倖存的她們在周遊列國後來此當老師、並期待未來的某一天還能見到族人。
為了融入人類社會
或是給予惡人他們應有的業報。
但好像來錯地方了？
目前只上過美術課，老到超級沒用。`
  }
},


//帕拉帕帕
  papa: {
    title: "",
    bigname: "帕洛斯・特帕爾",
    littlename: "帕帕",
    img: "img/papa.png",
    bg: "img/18.webp",
    useDarkBg: false, // ture 是黑底  false 是白底
    info: {
      "陣營": "白色陣營",
      "種族": "團長大人的愛",
      "年齡": "25",
      "性別": "帕帕",
      "身高": "174",
      "體重": "66",
      "個性": `非常......騷?
討厭暴力
行為舉止夾帶著一股優雅的氣質`,
      "喜歡": "漂亮美好的事物",
      "討厭": "動粗、爆粗口、醜陋的事物",
      "角色備註/裏設定": `她的性別認同是女生
所以都是用女廁跟女澡堂/女湯喔
如果要需要稱呼請稱呼她為小姐喔!
# 帕帕關心學生，是因為他身為教師的職責 而不是發自內心的
# 能讓帕帕發自內心ＬＯＶＥ的只有原世界的團長
# 帕帕已經死掉了，所以瞳孔沒有辦法反射光
# 帕帕最近發現跟部分學生相處起來很自在 帕帕過去不曾如此自在 帕帕感到開心 他想試著珍惜這些
# 即使如此 帕帕心理團長的位置依舊是不可動搖的

過去擅長的魔法是 火
偶爾會一人抽菸發呆 或許是沒有完全放下過去吧
# 帕帕不會在學生眼前抽菸
`,
      "背景故事/設定": `15歲時被年輕的騎士團長所幫助
發誓要追隨騎士團長並加入的騎士團訓練營
曾經因為中性的外表被嘲笑
但憑藉著自身魔法的天賦與劍術
輕鬆打敗了眾多譏笑她的人

強大的實力被騎士團看中
卻發現騎士團已經非常腐敗
還跟外面不良集團合夥做了很多違法事業

為了更接近團長 他認同了腐敗的騎士團
放開了自我壓抑
選擇了對自己最輕鬆的生活方式
用強大的實力爬到隊長的位置
成為強大的魔劍士隊長
然而卻也因為追隨騎士團長
自己也染上了不少惡習

在一次肅清騎士團的行動中
自身阻擋兩名強大的先鋒隊
最終被強大到像是開掛的先鋒隊砍成兩半
直到最後都堅持幫助團長
用魔法創造了巨大的火焰爆炸後
失血過多身亡

"即使如此 我仍舊追隨於您 親愛的團長"

死後靈魂不知為何掉落到了謝爾夏的世界
甚致本該被一刀兩斷的身體都完好無缺
賣掉了所有騎士相關的東西
換了一身新服裝 
以此希望拋棄過去 重新過活
只留下一把軍刀作為紀念

來到謝爾夏世界的他
不知為何失去了所有魔力與魔力感知
再也無法操控魔法了
為了生活
因緣際會來到學校當起了老師`
    }
  },

 

//---謝爾夏公務員 Ｒｏｒｏ---
roro: {
  title: "公務員證",
  bigname: "謝爾夏公務員",
  littlename: "Ｒｏｒｏ",
  img: "img/ro.png",
  bg: "img/20.webp",
  useDarkBg: true,

  info: {
    "陣營": "黑色陣營",
    "種族": "爆肝工程師",
    "年齡": "SOS",
    "性別": "Roro",
    "身高": "168",
    "體重": "SOS",
    "個性": `
今天也躺在地上睡著了`,
    "喜歡": `貓咪們`,
    "討厭": `時間明明不夠
卻躺在地上起不來`,
    "角色備註/裏設定": `目前請特休去深造中`,
    "背景故事/設定": `會為了

珍視的你

去燃燒

小宇宙`
  }
},

//---拉斐爾 優---
yu: {
  title: "",
  bigname: "拉斐爾",
  littlename: "優",
  img: "img/yu.png",
  bg: "img/20.webp",
  useDarkBg: false, // ture 是黑底  false 是白底
  info: {
    "陣營": "白色陣營",
    "種族": "說不定是赤丸喔",
    "年齡": "23",
    "性別": "男",
    "身高": "185",
    "體重": "78",

    "個性": `・明明是「烏索阿蘭」裡的「保健老師」卻身著和服，與普遍保健老師的形象完全不同。
・怪裡怪氣、隨著自己的意志行動，老師～學生～校長～通通都喜歡玩！心情行動超級難捉摸喔～
・有著「修補師」的稱號、厲害的在於只要是「身體」他「什麼都能修」，疾病啊～癌症啊～絕症啊～通通一揮手就可以和痛苦說掰掰！「塞巴頓」乃至整個「謝爾夏」都知曉他的存在`,

    "喜歡": "視心情而定～",
    "討厭": "視心情而定～",

    "角色備註/裏設定": `擁有「謝爾夏」頂尖的恢復術、傳說能在心跳停止的半鐘頭內都能救活。

無關你的意志、只要一抬手便能將傷痕撫去，不過本人的心情漂浮不定、可能會慢慢補或者一下給我補完或者等你半死不活時才救援。`,

    "背景故事/設定": `我是個年輕的保健室老師啾咪！！`
  }
}


//結束符號
};
