window.teachers = {
  papa: {
    bigname: "帕洛斯・特帕爾",
    littlename: "帕帕",
    img: "img/papa.png",
    bg: "img/18.webp",
    useDarkBg: false, // ture 是黑底  false 是白底
    info: {
      "陣營": "白色陣營",
      "種族": "團長大人的愛",
      "年齡": "25",
      "性別": "帕帕",
      "身高": "174",
      "體重": "66",
      "個性": `非常......騷?
討厭暴力
行為舉止夾帶著一股優雅的氣質`,
      "喜歡": "漂亮美好的事物",
      "討厭": "動粗、爆粗口、醜陋的事物",
      "角色備註/裏設定": `她的性別認同是女生
所以都是用女廁跟女澡堂/女湯喔
如果要需要稱呼請稱呼她為小姐喔!`,
      "背景故事/設定": `15歲時被年輕的騎士團長所幫助
發誓要追隨騎士團長並加入的騎士團訓練營
曾經因為中性的外表被嘲笑
但憑藉著自身魔法的天賦與劍術
輕鬆打敗了眾多譏笑她的人

強大的實力被騎士團看中
卻發現騎士團已經非常腐敗
還跟外面不良集團合夥做了很多違法事業

為了更接近團長 他認同了腐敗的騎士團
放開了自我壓抑
選擇了對自己最輕鬆的生活方式
用強大的實力爬到隊長的位置
成為強大的魔劍士隊長
然而卻也因為追隨騎士團長
自己也染上了不少惡習

在一次肅清騎士團的行動中
自身阻擋兩名強大的先鋒隊
最終被強大到像是開掛的先鋒隊砍成兩半
直到最後都堅持幫助團長
用魔法創造了巨大的火焰爆炸後
失血過多身亡

"即使如此 我仍舊追隨於您 親愛的團長"

死後靈魂不知為何掉落到了謝爾夏的世界
甚致本該被一刀兩斷的身體都完好無缺
賣掉了所有騎士相關的東西
換了一身新服裝 
以此希望拋棄過去 重新過活
只留下一把軍刀作為紀念

來到謝爾夏世界的他
不知為何失去了所有魔力與魔力感知
再也無法操控魔法了
為了生活
因緣際會來到學校當數學老師`
    }
  },

  
 // 再加更多老師範例：
/* 複製用
 英文名: {
  bigname: "角色全名（10字以內）",
  littlename: "簡稱（可不填）",
  img: "img/papa.png",
  bg: "img/18.webp",
  useDarkBg: true/false , // ture 是黑底  false 是白底

  info: {
    "陣營": "白色/黑色 陣營",
    "種族": "最多9字",
    "年齡": "數字",
    "性別": "男/女/?",
    "身高": "數字",
    "體重": "數字",
    "個性": `可直接ENTER換行`,
    "喜歡": "可自由填",
    "討厭": "可自由填",
    "角色備註/裏設定": `可直接ENTER換行`,
    "背景故事/設定": `可直接ENTER換行`
  }
}
*/
//以下開放新增老師

test: {
  bigname: "角色全名（10字以內）",
  littlename: "簡稱（可不填）",
  img: "img/papa.png",
  bg: "img/18.webp",
  useDarkBg: true , // ture 是黑底  false 是白底
  info: {
    "陣營": "白色/黑色 陣營",
    "種族": "最多9字",
    "年齡": "數字",
    "性別": "男/女/?",
    "身高": "數字",
    "體重": "數字",
    "個性": `可直接ENTER換行`,
    "喜歡": "可自由填",
    "討厭": "可自由填",
    "角色備註/裏設定": `可直接ENTER換行`,
    "背景故事/設定": `可直接ENTER換行`
  }
}

//結束符號
};
